---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleY
source: html/1ede62d9-b039-68b1-63cb-94fcfb7d7728.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleY Property

The property labeled "Size Y" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldScaleY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance" with a minimum of "0.01".